02-03-escrevendo-programas.org
#+setupfile: static/setupfile.org
#+html_link_up: 02-sintaxe.html
#+title: Escrevendo programas
#+options: toc:t

Agora que falamos de listas, podemos finalmente falar dos programas de
Majestic Lisp.

Programas  de  Majestic   Lisp  são  tratados  como   um  /conjunto  de
expressões/. Essas expressões podem ser símbolos individuais, ou /listas/
com arranjo específico.

Como anteriormente citado, um símbolo individual normalmente é tratado
como um  rótulo para um valor.  Já uma lista pode  estar relacionada à
/aplicação de uma  função/, execução de uma /forma  especial/ ou /aplicação
de um macro/.

Por exemplo, a expressão a seguir define uma função capaz de dobrar um
número qualquer, aqui chamada ~double~:

#+begin_src majestic
(defn double (x)
  (* x 2))
#+end_src

#+RESULTS[bdd2d06d21a7e970c7d0948e69ed73577e80e51e]:
: double

Apesar de ser um uso específico do macro[fn:6] ~defn~, a expressão acima
continua sendo  uma lista,  segundo o  que já foi  dito a  respeito da
sintaxe  das  mesmas. A  diferença  crucial  está em  não  realizarmos
/quoting/ na expressão, o que indica que ela deverá ser interpretada.

Durante a  interpretação, o interpretador verifica  o primeiro símbolo
da   lista  e   percebe   que   ~defn~  está   atrelado   a  um   macro;
subsequentemente, realiza  os passos de interpretação  necessários que
levam, ao final, à atribuição de uma função ao símbolo ~double~.

Veremos a seguir algumas funções e  formas especiais que são padrão em
Majestic, bem como o uso das mesmas.

** Declaração de variáveis

#+index: variável
A maioria das linguagens possui uma forma de atribuir /rótulos/ a certos
valores, e  Majestic Lisp não  é diferente nesse aspecto.  Nela, temos
uma  forma de  definir  valores  que estarão  acessíveis  para todo  o
programa, e  também valores que  estarão acessíveis apenas  em regiões
específicas,  que  geralmente  chamamos  de  /escopo/.

#+index: variável dinâmica
Outra  forma  de  utilização  de  uma  variável  está  em  redefini-la
dinamicamente de  acordo com um  contexto, porém não  abordaremos este
método nas seções subsequentes.

*** Variáveis globais

#+index: variável global
Variáveis globais  são variáveis  que, normalmente, são  acessíveis em
qualquer região de um programa.

Majestic  Lisp armazena,  em um  estado  global, uma  tabela que  liga
certos rótulos (símbolos) a certos valores.

Podemos  usar a  /forma especial/  ~def~ para  definir uma  variável.

A seguir,  usamos ~def~  para /definir/  uma variável  global ~x~,  de valor
numérico ~5~. Como resposta, o  interpretador retorna o mesmo símbolo ~x~,
indicando que este foi definido com sucesso.

#+begin_src majestic
(def x 5)
#+end_src

#+RESULTS[a7ef9ea5f10b806d0b71a4ae6ac52f2f685e704c]:
: x

Se, logo em seguida, formos ao REPL  e digitarmos o símbolo ~x~ para que
seja interpretado, o interpretador retornará  o valor associado a esse
símbolo:

#+begin_src majestic
x
#+end_src

#+RESULTS[a6b25a9fd7dc9181da6c0dba94f2c7f41bece54c]:
: 5

Caso digitássemos um símbolo não-/quotado/  que não correspondesse a uma
variável anteriormente definida, o  interpretador informaria que há um
erro.

#+index: atribuição de valor
Podemos redefinir  o valor  de uma variável  com facilidade,  usando a
forma  especial ~set~.  Ela nos  permite realizar  atribuições de  novos
valores a variáveis já existentes.

#+begin_src majestic
(set x 9)
#+end_src

#+RESULTS[99c5197e909529ebf5af90cdeeb297f94081ff43]:
: x

#+begin_src majestic
x
#+end_src

#+RESULTS[a6b25a9fd7dc9181da6c0dba94f2c7f41bece54c]:
: 9

~set~ só pode ser utilizado em uma variável global após a mesma ter sido
atribuída, através de ~def~.

*** Variáveis locais

#+index: variável local
Há uma  forma de definir  variáveis apenas temporariamente  através da
criação de  um /escopo/. O  interpretador de Majestic Lisp  tratará essa
variável como definida apenas dentro do mesmo; fora, a variável já não
estará definida.

#+begin_src majestic
(let ((y 9))
  y)
#+end_src

#+RESULTS[d9642c8dc12352ff74bf51b45eec1ec4897df7f2]:
: 9

Na  situação acima,  usamos o  /macro/ ~let~  para definir  localmente uma
única  variável ~y~,  que  estará  definida apenas  para  o corpo  desse
macro.

O macro ~let~ tem a forma a seguir:

#+begin_example
(let (<definições>)
  <corpo>)
#+end_example

...onde ~<definições>~ é um número arbitrário de duplas na forma ~(rótulo
valor)~, e ~<corpo>~ é *uma única expressão*, que será interpretada levando
em consideração as variáveis localmente definidas.

O exemplo anterior  funciona como se tivéssemos definido  a variável ~y~
globalmente usando o valor ~9~ e  pedíssemos o valor associado a ~y~. Logo
em seguida, o interpretador "esquece"  que essa variável foi algum dia
definida.

Também podemos redefinir o valor de uma variável local, usando a forma
especial ~set~:

#+begin_src majestic
(let ((y 9))
  (set y 10)
  y)
#+end_src

#+RESULTS[781bd97382f5a604c81c3583107ed9e62a1adf54]:
: 10

