doc/html/02-03-escrevendo-programas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Escrevendo programas</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="02-sintaxe.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Escrevendo programas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3369cb3">1. Declaração de variáveis</a>
<ul>
<li><a href="#orgb6f120a">1.1. Variáveis globais</a></li>
<li><a href="#org80d0deb">1.2. Variáveis locais</a>
<ul>
<li><a href="#org4500503"><b>Sombreando variáveis.</b></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfdeb4fc">2. Funções</a>
<ul>
<li><a href="#orge64b3db">2.1. Funções primitivas</a></li>
<li><a href="#orgbe812e7">2.2. Aplicação de funções</a></li>
<li><a href="#org4990cdd">2.3. Funções do usuário</a>
<ul>
<li><a href="#org085a7ab"><b>Funções locais.</b></a></li>
<li><a href="#org7615a7c">Funções globais recursivas.</a></li>
<li><a href="#org76c07ac">Funções locais recursivas.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgef46abb">3. Controle de fluxo</a></li>
<li><a href="#orgd7e911c">4. <i>Quasiquoting</i></a></li>
</ul>
</div>
</div>
<p>
Agora que falamos de listas, podemos finalmente falar dos programas de
Majestic Lisp.
</p>

<p>
Programas  de  Majestic   Lisp  são  tratados  como   um  <i>conjunto  de
expressões</i>. Essas expressões podem ser símbolos individuais, ou <i>listas</i>
com arranjo específico.
</p>

<p>
Como anteriormente citado, um símbolo individual normalmente é tratado
como um  rótulo para um valor.  Já uma lista pode  estar relacionada à
<i>aplicação de uma  função</i>, execução de uma <i>forma  especial</i> ou <i>aplicação
de um macro</i>.
</p>

<p>
Por exemplo, a expressão a seguir define uma função capaz de dobrar um
número qualquer, aqui chamada <code>double</code>:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> double <span style="color: #da70d6;">(</span>x<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">*</span> x 2<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
double
</pre>


<p>
Apesar de ser um uso específico do macro<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> <code>defn</code>, a expressão acima
continua sendo  uma lista,  segundo o  que já foi  dito a  respeito da
sintaxe  das  mesmas. A  diferença  crucial  está em  não  realizarmos
<i>quoting</i> na expressão, o que indica que ela deverá ser interpretada.
</p>

<p>
Durante a  interpretação, o interpretador verifica  o primeiro símbolo
da   lista  e   percebe   que   <code>defn</code>  está   atrelado   a  um   macro;
subsequentemente, realiza  os passos de interpretação  necessários que
levam, ao final, à atribuição de uma função ao símbolo <code>double</code>.
</p>

<p>
Veremos a seguir algumas funções e  formas especiais que são padrão em
Majestic, bem como o uso das mesmas.
</p>

<div id="outline-container-org3369cb3" class="outline-2">
<h2 id="org3369cb3"><span class="section-number-2">1.</span> Declaração de variáveis</h2>
<div class="outline-text-2" id="text-1">
<p>
A maioria das linguagens possui uma forma de atribuir <i>rótulos</i> a certos
valores, e  Majestic Lisp não  é diferente nesse aspecto.  Nela, temos
uma  forma de  definir  valores  que estarão  acessíveis  para todo  o
programa, e  também valores que  estarão acessíveis apenas  em regiões
específicas,  que  geralmente  chamamos  de  <i>escopo</i>.
</p>

<p>
Outra  forma  de  utilização  de  uma  variável  está  em  redefini-la
dinamicamente de  acordo com um  contexto, porém não  abordaremos este
método nas seções subsequentes.
</p>
</div>

<div id="outline-container-orgb6f120a" class="outline-3">
<h3 id="orgb6f120a"><span class="section-number-3">1.1.</span> Variáveis globais</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Variáveis globais  são variáveis  que, normalmente, são  acessíveis em
qualquer região de um programa.
</p>

<p>
Majestic  Lisp armazena,  em um  estado  global, uma  tabela que  liga
certos rótulos (símbolos) a certos valores.
</p>

<p>
Podemos  usar a  <i>forma especial</i>  <code>def</code> para  definir uma  variável.
</p>

<p>
A seguir,  usamos <code>def</code>  para <i>definir</i>  uma variável  global <code>x</code>,  de valor
numérico <code>5</code>. Como resposta, o  interpretador retorna o mesmo símbolo <code>x</code>,
indicando que este foi definido com sucesso.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> x 5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
x
</pre>


<p>
Se, logo em seguida, formos ao REPL  e digitarmos o símbolo <code>x</code> para que
seja interpretado, o interpretador retornará  o valor associado a esse
símbolo:
</p>

<div class="org-src-container">
<pre class="src src-majestic">x
</pre>
</div>

<pre class="example">
5
</pre>


<p>
Caso digitássemos um símbolo não-<i>quotado</i>  que não correspondesse a uma
variável anteriormente definida, o  interpretador informaria que há um
erro.
</p>

<p>
Podemos redefinir  o valor  de uma variável  com facilidade,  usando a
forma  especial <code>set</code>.  Ela nos  permite realizar  atribuições de  novos
valores a variáveis já existentes.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">set</span> x 9<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
x
</pre>


<div class="org-src-container">
<pre class="src src-majestic">x
</pre>
</div>

<pre class="example">
9
</pre>


<p>
<code>set</code> só pode ser utilizado em uma variável global após a mesma ter sido
atribuída, através de <code>def</code>.
</p>
</div>
</div>

<div id="outline-container-org80d0deb" class="outline-3">
<h3 id="org80d0deb"><span class="section-number-3">1.2.</span> Variáveis locais</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Há uma  forma de definir  variáveis apenas temporariamente  através da
criação de  um <i>escopo</i>. O  interpretador de Majestic Lisp  tratará essa
variável como definida apenas dentro do mesmo; fora, a variável já não
estará definida.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">let</span> <span style="color: #da70d6;">(</span><span style="color: #87cefa;">(</span>y 9<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  y<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
9
</pre>


<p>
Na  situação acima,  usamos o  <i>macro</i> <code>let</code>  para definir  localmente uma
única  variável <code>y</code>,  que  estará  definida apenas  para  o corpo  desse
macro.
</p>

<p>
O macro <code>let</code> tem a forma a seguir:
</p>

<pre class="example" id="org3552bb0">
(let (&lt;definições&gt;)
  &lt;corpo&gt;)
</pre>

<p>
&#x2026;onde <code>&lt;definições&gt;</code> é um número arbitrário de duplas na forma <code>(rótulo
valor)</code>, e <code>&lt;corpo&gt;</code> é <b>uma única expressão</b>, que será interpretada levando
em consideração as variáveis localmente definidas.
</p>

<p>
O exemplo anterior  funciona como se tivéssemos definido  a variável <code>y</code>
globalmente usando o valor <code>9</code> e  pedíssemos o valor associado a <code>y</code>. Logo
em seguida, o interpretador "esquece"  que essa variável foi algum dia
definida.
</p>

<p>
Também podemos redefinir o valor de uma variável local, usando a forma
especial <code>set</code>:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">let</span> <span style="color: #da70d6;">(</span><span style="color: #87cefa;">(</span>y 9<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">set</span> y 10<span style="color: #da70d6;">)</span>
  y<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
10
</pre>
</div>
