02-03-escrevendo-programas.org
**** *Sombreando variáveis.*
:PROPERTIES:
:UNNUMBERED: t
:END:

#+index: sombreamento de variável
Podemos   usar  definições   locais  para   utilizarmos  a   ideia  de
/sombreamento/,  para  efetuar  redefinições  temporárias  de  variáveis
globais, ou até mesmo de variáveis locais, em caso de ~let~'s aninhados.

#+begin_src majestic
(def x 5)
#+end_src

#+RESULTS[12d278be7186e21e953240059e127588b617c423]:
: x

#+begin_src majestic
(let ((x 6))
  x)
#+end_src

#+RESULTS[ee2f1c26d0a3a1ee39b80854b6ca2ac6606ed8dc]:
: 6

#+begin_src majestic
x
#+end_src

#+RESULTS[5c1ca8479c30dde4d6b5a9f977503b6b7bd4b56c]:
: 5

O exemplo acima mostra uma variável global ~x~ cujo valor atribuído é ~5~;
em seguida, criamos um escopo onde  ~x~ possui o valor ~6~, e requisitamos
nele o valor  de ~x~.  Após a  execução desse escopo, ~x~ "volta"  a ter o
valor associado ~5~.

** Funções

Até agora, vimos estruturas especiais de listas a serem interpretadas,
mais  especificamente /formas  especiais/  e /macros/.  Mas  e quanto  aos
outros tipos de lista?

Quando  temos uma  lista  "comum", o  interpretador  de Majestic  Lisp
espera que o  primeiro elemento da lista seja uma  /função/. Funções são
fragmentos de código  que realizam operações específicas,  e que podem
ser reutilizados posteriormente.

Em  Majestic  Lisp, temos  dois  tipos  de  funções: /primitivas/  e  /de
usuário/.

*** Funções primitivas

As funções primitivas de Majestic  Lisp são funções já definidas antes
da   execução   do   interpretador.  Isso   significa   que   qualquer
implementação da  linguagem precisa garantir que  essas funções possam
ser utilizadas.

Uma dessas funções é a  função ~+~, responsável principalmente por somar
números.  Essa  função  aceita  qualquer quantidade  de  números  como
/argumentos/ e, quando fornecidos dois ou mais argumentos, ela retorna a
soma de todos esses números[fn:8].

#+begin_src majestic
(+ 2 3)
#+end_src

#+RESULTS[bc13b4701ca542bc4e323153cceed182e026dcf6]:
: 5

#+begin_src majestic
(+ 5 7 1)
#+end_src

#+RESULTS[6814837a598b8e7872893de9ba0cb238b47a15d3]:
: 13

Há também outras funções primitivas de aritmética, capazes de executar
multiplicação (~*~), divisão (~/~) e subtração (~-~). Podemos inclusive usar
sublistas  para realizar  mais  operações com  o  resultado de  outras
operações; nesse caso, também é  pertinente indentar nosso código para
melhor legibilidade.

#+begin_src majestic
(+ (/ 8 2)
   (+ 1 3)
   (* 7 7))
#+end_src

#+RESULTS[47784cd1a88fd44fcdbe4be0208edf8f85d094fd]:
: 57

*** Aplicação de funções

Outro  exemplo de  função  primitiva, muito  utilizada,  é ~cons~.  Essa
função requer  exatamente /dois/ argumentos,  e pode ser  utilizada para
criar uma célula /cons/. Veja o exemplo um pouco mais complexo a seguir.

#+begin_src majestic
(let ((x 2)
      (y 3))
  (cons x y))
#+end_src

#+RESULTS[e13b5b1016c38db15f7eb098ca899fcab3f9c6e0]:
: (2 . 3)

Aqui, temos as  variáveis locais ~x~ e  ~y~, de valores atribuídos  ~2~ e ~3~,
respectivamente.

Ao passarmos as variáveis locais ~x~ e ~y~ para ~cons~, veja que não estamos
/quotando/ esses rótulos. Isso significa que  o que está sendo passado a
/cons/  não são  os  nomes das  variáveis,  mas sim  os  valores a  eles
atribuídos.

Da mesma forma, ~cons~ é apenas o /rótulo/ de uma certa operação, que cria
uma célula /cons/ a partir de dois valores.

O resultado da operação  é uma célula cujo /car/ é ~2~ e  cujo /cdr/ é ~3~. Ao
final do  escopo do  ~let~, as  variáveis ~x~ e  ~y~ deixarão  de "existir",
permanecendo apenas a célula /cons/ retornada, contendo esses valores.

Podemos constatar  os valores de /car/  e /cdr/ de uma  função através das
funções primitivas homônimas, ~car~ e ~cdr~. A seguir, temos um exemplo um
pouco  mais  complexo, que  toma  o  retorno do  escopo  anteriormente
demonstrado, colocando-o em uma variável para ser consultada depois.

#+begin_src majestic
(def my-cell
  (let ((x 2)
        (y 3))
    (cons x y)))
#+end_src

#+RESULTS[f9d96639da946e38db01c6a9dda05c4a2490f126]:
: my-cell

#+begin_src majestic
my-cell
#+end_src

#+RESULTS[d114dc282580280ad7d6e7e8820b308b687293d7]:
: (2 . 3)

#+begin_src majestic
(car my-cell)
#+end_src

#+RESULTS[099e37e4fae3dbeb64e34d02f0b2870dc48de45e]:
: 2

#+begin_src majestic
(cdr my-cell)
#+end_src

#+RESULTS[0050c3a544d1fdc9806e8ef57cd78c455661d8a0]:
: 3

