doc/html/02-03-escrevendo-programas.html

<div id="outline-container-org4500503" class="outline-4">
<h4 id="org4500503"><b>Sombreando variáveis.</b></h4>
<div class="outline-text-4" id="text-org4500503">
<p>
Podemos   usar  definições   locais  para   utilizarmos  a   ideia  de
<i>sombreamento</i>,  para  efetuar  redefinições  temporárias  de  variáveis
globais, ou até mesmo de variáveis locais, em caso de <code>let</code>'s aninhados.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> x 5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
x
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">let</span> <span style="color: #da70d6;">(</span><span style="color: #87cefa;">(</span>x 6<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  x<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
6
</pre>


<div class="org-src-container">
<pre class="src src-majestic">x
</pre>
</div>

<pre class="example">
5
</pre>


<p>
O exemplo acima mostra uma variável global <code>x</code> cujo valor atribuído é <code>5</code>;
em seguida, criamos um escopo onde  <code>x</code> possui o valor <code>6</code>, e requisitamos
nele o valor  de <code>x</code>.  Após a  execução desse escopo, <code>x</code> "volta"  a ter o
valor associado <code>5</code>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfdeb4fc" class="outline-2">
<h2 id="orgfdeb4fc"><span class="section-number-2">2.</span> Funções</h2>
<div class="outline-text-2" id="text-2">
<p>
Até agora, vimos estruturas especiais de listas a serem interpretadas,
mais  especificamente <i>formas  especiais</i>  e <i>macros</i>.  Mas  e quanto  aos
outros tipos de lista?
</p>

<p>
Quando  temos uma  lista  "comum", o  interpretador  de Majestic  Lisp
espera que o  primeiro elemento da lista seja uma  <i>função</i>. Funções são
fragmentos de código  que realizam operações específicas,  e que podem
ser reutilizados posteriormente.
</p>

<p>
Em  Majestic  Lisp, temos  dois  tipos  de  funções: <i>primitivas</i>  e  <i>de
usuário</i>.
</p>
</div>

<div id="outline-container-orge64b3db" class="outline-3">
<h3 id="orge64b3db"><span class="section-number-3">2.1.</span> Funções primitivas</h3>
<div class="outline-text-3" id="text-2-1">
<p>
As funções primitivas de Majestic  Lisp são funções já definidas antes
da   execução   do   interpretador.  Isso   significa   que   qualquer
implementação da  linguagem precisa garantir que  essas funções possam
ser utilizadas.
</p>

<p>
Uma dessas funções é a  função <code>+</code>, responsável principalmente por somar
números.  Essa  função  aceita  qualquer quantidade  de  números  como
<i>argumentos</i> e, quando fornecidos dois ou mais argumentos, ela retorna a
soma de todos esses números<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">+</span> 2 3<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
5
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">+</span> 5 7 1<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
13
</pre>


<p>
Há também outras funções primitivas de aritmética, capazes de executar
multiplicação (<code>*</code>), divisão (<code>/</code>) e subtração (<code>-</code>). Podemos inclusive usar
sublistas  para realizar  mais  operações com  o  resultado de  outras
operações; nesse caso, também é  pertinente indentar nosso código para
melhor legibilidade.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">+</span> <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">/</span> 8 2<span style="color: #da70d6;">)</span>
   <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">+</span> 1 3<span style="color: #da70d6;">)</span>
   <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">*</span> 7 7<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
57
</pre>
</div>
</div>

<div id="outline-container-orgbe812e7" class="outline-3">
<h3 id="orgbe812e7"><span class="section-number-3">2.2.</span> Aplicação de funções</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Outro  exemplo de  função  primitiva, muito  utilizada,  é <code>cons</code>.  Essa
função requer  exatamente <i>dois</i> argumentos,  e pode ser  utilizada para
criar uma célula <i>cons</i>. Veja o exemplo um pouco mais complexo a seguir.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">let</span> <span style="color: #da70d6;">(</span><span style="color: #87cefa;">(</span>x 2<span style="color: #87cefa;">)</span>
      <span style="color: #87cefa;">(</span>y 3<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">cons</span> x y<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(2 . 3)
</pre>


<p>
Aqui, temos as  variáveis locais <code>x</code> e  <code>y</code>, de valores atribuídos  <code>2</code> e <code>3</code>,
respectivamente.
</p>

<p>
Ao passarmos as variáveis locais <code>x</code> e <code>y</code> para <code>cons</code>, veja que não estamos
<i>quotando</i> esses rótulos. Isso significa que  o que está sendo passado a
<i>cons</i>  não são  os  nomes das  variáveis,  mas sim  os  valores a  eles
atribuídos.
</p>

<p>
Da mesma forma, <code>cons</code> é apenas o <i>rótulo</i> de uma certa operação, que cria
uma célula <i>cons</i> a partir de dois valores.
</p>

<p>
O resultado da operação  é uma célula cujo <i>car</i> é <code>2</code> e  cujo <i>cdr</i> é <code>3</code>. Ao
final do  escopo do  <code>let</code>, as  variáveis <code>x</code> e  <code>y</code> deixarão  de "existir",
permanecendo apenas a célula <i>cons</i> retornada, contendo esses valores.
</p>

<p>
Podemos constatar  os valores de <i>car</i>  e <i>cdr</i> de uma  função através das
funções primitivas homônimas, <code>car</code> e <code>cdr</code>. A seguir, temos um exemplo um
pouco  mais  complexo, que  toma  o  retorno do  escopo  anteriormente
demonstrado, colocando-o em uma variável para ser consultada depois.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> my-cell
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">let</span> <span style="color: #87cefa;">(</span><span style="color: #ffd700;">(</span>x 2<span style="color: #ffd700;">)</span>
        <span style="color: #ffd700;">(</span>y 3<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
    <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">cons</span> x y<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
my-cell
</pre>


<div class="org-src-container">
<pre class="src src-majestic">my-cell
</pre>
</div>

<pre class="example">
(2 . 3)
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">car</span> my-cell<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
2
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">cdr</span> my-cell<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
3
</pre>
</div>
</div>
