02-03-escrevendo-programas.org
*** Funções do usuário

As funções  de usuário  de Majestic Lisp  são funções  declaradas pelo
usuário  do   sistema,  diferentemente  das  funções   primitivas  que
já existem quando o sistema é iniciado.

A sintaxe para a declaração de uma função envolve a forma especial ~fn~,
que pode ser compreendida como:

#+begin_example
(fn <argumentos> <corpo>)
#+end_example

...onde ~<argumentos>~  é, normalmente, uma  lista de argumentos  para a
função, e  ~<corpo>~ é  uma única  expressão a  ser executada  durante a
invocação da função.

O  exemplo  a  seguir  envolve  a   função  que  eleva  um  número  ao
quadrado. Como  podemos observar, a  função recebe um  único argumento
(aqui chamado ~x~), e então multiplica-o por si mesmo.

O resultado  retornado é um  formato de  impressão de uma  função, que
normalmente não pode ser reinserido no REPL.

#+begin_src majestic
(fn (x) (* x x))
#+end_src

#+RESULTS[ff053edb3d5eff40ac33e5832c54f362a65ca6fd]:
: #<function (fn (x)) {0x565242ffe170}>

Funções  são  /cidadãos  de  primeira-classe/  em  Majestic  Lisp.  Isso
significa que  elas podem ser  rotuladas, repassadas em  aplicações de
outras funções e  atribuídas a novos rótulos, assim  como faríamos com
qualquer outro valor.

Podemos, por exemplo, atribuir a nossa função ao símbolo ~square~:

#+begin_src majestic
(def square
  (fn (x) (* x x)))
#+end_src

#+RESULTS[96cfbf61873e4c9ebe4c4f2fbe65ca1be252ce68]:
: square

Para  que não  precisemos  usar com  frequência a  dupla  ~def~ ...  ~fn~,
instituiremos um  atalho sintático (um  /macro/) que faça  este trabalho
por nós, tornando  as funções mais simples de serem  lidas. Este macro
se chamará ~defn~, e poderá ser escrito usando a regra sintática:

#+begin_example
(defn <nome> <argumentos> <corpo>)
#+end_example

Se esse "atalho sintático" fosse  expandido, seria exatamente igual ao
exemplo anterior,  em que usamos ~def~  e ~fn~, portanto as  regras para o
símbolo, os argumentos e o corpo ainda se aplicam.

#+begin_src majestic
(defn square (x)
  (* x x))
#+end_src

#+RESULTS[e8003c1a273695808c9e350efca845729616c733]:
: square

A aplicação de uma função do usuário é muito similar, se não idêntica,
à aplicação de uma função primitiva.

#+begin_src majestic
(square 5)
#+end_src

#+RESULTS[acd4cb8ea8a6b462f0a366ba3f289670333ff34c]:
: 25

**** *Funções locais.*
:PROPERTIES:
:UNNUMBERED: t
:END:

Assim  como no  caso das  variáveis locais,  existem situações  onde é
interessante  criar  funções de  usuário  que  só valham  para  certos
escopos. Isso  pode ser feito  usando a  forma ~letfn~, que  atribui uma
função a um símbolo em um escopo léxico, tal qual a forma ~let~.

Similar  a ~defn~,  cada  cláusula de  ~letfn~, de  forma  análoga a  ~let~,
define uma  função local. A sintaxe  de cada cláusula é  idêntica à de
~defn~, excluindo-se o uso do símbolo ~defn~ em si.

O exemplo a seguir define globalmente a função de usuário ~1+~, que soma
uma unidade a um certo número. Em seguida, criamos um escopo onde ~1+~ é
redefinido  como  uma função  que  soma  um  número  a si  mesmo;  tal
definição desaparece ao fim desse escopo.

#+begin_src majestic
(defn 1+ (x) (+ x 1))
#+end_src

#+RESULTS[55ec371a8a543c28080a1baf5d5c6fcb6810c7bf]:
: 1+

#+begin_src majestic
(letfn ((1+ (x)
          (+ x x)))
  (1+ 5))
#+end_src

#+RESULTS[d8bcbed0d183e7beea9260d04b444970cf233988]:
: 10

#+begin_src majestic
(1+ 5)
#+end_src

#+RESULTS[3ecfd8bd6589ce3cbb11696c48ef9625b7a91309]:
: 6

**** Funções globais recursivas.
:PROPERTIES:
:UNNUMBERED: t
:END:

#+index: recursão global
É  interessante  observarmos  como  funciona  a  recursão  em  funções
definidas globalmente em Majestic Lisp.

A  função ~foo~  a seguir  é recursiva  (pois sua  definição depende  da
invocação de si mesma).

#+begin_src majestic
(defn foo (n)
  (when (< n 3)
    (print "foo #{}" (1+ n))
    (foo (1+ n))))
#+end_src

#+RESULTS[8dc087ff8e6d0033a02a2a85b780e277f146b79e]:
: foo

#+begin_src majestic
(foo 0)
#+end_src

#+RESULTS[7c71bfa38230b68aefebaf4e34044f7db290f1e8]:
: foo #1
: foo #2
: foo #3
: nil

Durante  a  execução  de  ~foo~,   um  interpretador  de  Majestic  Lisp
consultará a tabela local de símbolos para realizar uma nova aplicação
da função atrelada ao símbolo  ~foo~. Isso ocorre sem maiores problemas,
já  que  ~foo~  está  registrado  em  um  contexto  visível  em  toda  a
aplicação.

