doc/html/02-03-escrevendo-programas.html

<div id="outline-container-org4990cdd" class="outline-3">
<h3 id="org4990cdd"><span class="section-number-3">2.3.</span> Funções do usuário</h3>
<div class="outline-text-3" id="text-2-3">
<p>
As funções  de usuário  de Majestic Lisp  são funções  declaradas pelo
usuário  do   sistema,  diferentemente  das  funções   primitivas  que
já existem quando o sistema é iniciado.
</p>

<p>
A sintaxe para a declaração de uma função envolve a forma especial <code>fn</code>,
que pode ser compreendida como:
</p>

<pre class="example" id="orgba64ba4">
(fn &lt;argumentos&gt; &lt;corpo&gt;)
</pre>

<p>
&#x2026;onde <code>&lt;argumentos&gt;</code>  é, normalmente, uma  lista de argumentos  para a
função, e  <code>&lt;corpo&gt;</code> é  uma única  expressão a  ser executada  durante a
invocação da função.
</p>

<p>
O  exemplo  a  seguir  envolve  a   função  que  eleva  um  número  ao
quadrado. Como  podemos observar, a  função recebe um  único argumento
(aqui chamado <code>x</code>), e então multiplica-o por si mesmo.
</p>

<p>
O resultado  retornado é um  formato de  impressão de uma  função, que
normalmente não pode ser reinserido no REPL.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">fn</span> <span style="color: #da70d6;">(</span>x<span style="color: #da70d6;">)</span> <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">*</span> x x<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
#&lt;function (fn (x)) {0x565242ffe170}&gt;
</pre>


<p>
Funções  são  <i>cidadãos  de  primeira-classe</i>  em  Majestic  Lisp.  Isso
significa que  elas podem ser  rotuladas, repassadas em  aplicações de
outras funções e  atribuídas a novos rótulos, assim  como faríamos com
qualquer outro valor.
</p>

<p>
Podemos, por exemplo, atribuir a nossa função ao símbolo <code>square</code>:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> square
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">fn</span> <span style="color: #87cefa;">(</span>x<span style="color: #87cefa;">)</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">*</span> x x<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
square
</pre>


<p>
Para  que não  precisemos  usar com  frequência a  dupla  <code>def</code> &#x2026;  <code>fn</code>,
instituiremos um  atalho sintático (um  <i>macro</i>) que faça  este trabalho
por nós, tornando  as funções mais simples de serem  lidas. Este macro
se chamará <code>defn</code>, e poderá ser escrito usando a regra sintática:
</p>

<pre class="example" id="org0facc83">
(defn &lt;nome&gt; &lt;argumentos&gt; &lt;corpo&gt;)
</pre>

<p>
Se esse "atalho sintático" fosse  expandido, seria exatamente igual ao
exemplo anterior,  em que usamos <code>def</code>  e <code>fn</code>, portanto as  regras para o
símbolo, os argumentos e o corpo ainda se aplicam.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> square <span style="color: #da70d6;">(</span>x<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">*</span> x x<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
square
</pre>


<p>
A aplicação de uma função do usuário é muito similar, se não idêntica,
à aplicação de uma função primitiva.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>square 5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
25
</pre>
</div>

<div id="outline-container-org085a7ab" class="outline-4">
<h4 id="org085a7ab"><b>Funções locais.</b></h4>
<div class="outline-text-4" id="text-org085a7ab">
<p>
Assim  como no  caso das  variáveis locais,  existem situações  onde é
interessante  criar  funções de  usuário  que  só valham  para  certos
escopos. Isso  pode ser feito  usando a  forma <code>letfn</code>, que  atribui uma
função a um símbolo em um escopo léxico, tal qual a forma <code>let</code>.
</p>

<p>
Similar  a <code>defn</code>,  cada  cláusula de  <code>letfn</code>, de  forma  análoga a  <code>let</code>,
define uma  função local. A sintaxe  de cada cláusula é  idêntica à de
<code>defn</code>, excluindo-se o uso do símbolo <code>defn</code> em si.
</p>

<p>
O exemplo a seguir define globalmente a função de usuário <code>1+</code>, que soma
uma unidade a um certo número. Em seguida, criamos um escopo onde <code>1+</code> é
redefinido  como  uma função  que  soma  um  número  a si  mesmo;  tal
definição desaparece ao fim desse escopo.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> <span style="color: #dcdcaa;">1+</span> <span style="color: #da70d6;">(</span>x<span style="color: #da70d6;">)</span> <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">+</span> x 1<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
1+
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">letfn</span> <span style="color: #da70d6;">(</span><span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">1+</span> <span style="color: #ffd700;">(</span>x<span style="color: #ffd700;">)</span>
          <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">+</span> x x<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">1+</span> 5<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
10
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> 5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
6
</pre>
</div>
</div>

<div id="outline-container-org7615a7c" class="outline-4">
<h4 id="org7615a7c">Funções globais recursivas.</h4>
<div class="outline-text-4" id="text-org7615a7c">
<p>
É  interessante  observarmos  como  funciona  a  recursão  em  funções
definidas globalmente em Majestic Lisp.
</p>

<p>
A  função <code>foo</code>  a seguir  é recursiva  (pois sua  definição depende  da
invocação de si mesma).
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> foo <span style="color: #da70d6;">(</span>n<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">when</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">&lt;</span> n 3<span style="color: #87cefa;">)</span>
    <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">print</span> <span style="color: #ce9178;">"foo #{}"</span> <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> n<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
    <span style="color: #87cefa;">(</span>foo <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> n<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
foo
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>foo 0<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
foo #1
foo #2
foo #3
nil
</pre>


<p>
Durante  a  execução  de  <code>foo</code>,   um  interpretador  de  Majestic  Lisp
consultará a tabela local de símbolos para realizar uma nova aplicação
da função atrelada ao símbolo  <code>foo</code>. Isso ocorre sem maiores problemas,
já  que  <code>foo</code>  está  registrado  em  um  contexto  visível  em  toda  a
aplicação.
</p>
</div>
</div>
