02-03-escrevendo-programas.org
**** Funções locais recursivas.
:PROPERTIES:
:UNNUMBERED: t
:END:

#+index: recursão local
O uso de ~letfn~ é suficiente  para a maioria das situações onde funções
locais  são necessárias,  porém, este  exemplo falha  quando a  função
local precisa  ser recursiva *e*  precisa ser executada em  outro escopo
que não seja o local.

Considere o  exemplo a seguir.  Temos um uso  de ~letfn~ que  define uma
função local ~foo~, igualmente recursiva  como no exemplo de recursão em
funções globais. Todavia, o escopo de  ~letfn~ retorna a função ligada a
~foo~ localmente, que é então atribuída ao símbolo ~bar~ globalmente.

#+begin_src majestic
(def bar
  (letfn ((foo (n)
            (when (< n 3)
              (print "foo #{}" (1+ n))
              (foo (1+ n)))))
    foo))
#+end_src

#+RESULTS[e5cd1f205e43d9fc3cd50e7f1cbe6628f87b4232]:
: bar

Quando ~bar~  for executada,  note que,  mesmo que  a função  tenha sido
originalmente atribuída como  ~foo~, como este símbolo já  não existe no
contexto local (e nem em um contexto global), ~bar~ executará apenas uma
vez, mostrando um erro assim que ~foo~ for invocada.

#+begin_src majestic
(bar 0)
#+end_src

#+RESULTS[864f55666bfe2165e434fb52ccc4cb5bae0186f2]:
: foo #1
: Error: foo is unbound

Isso ocorre  porque, quando definimos  uma função recursiva  local via
~letfn~, essa função não captura o  escopo na qual foi criada; em outras
palavras, quando a execução de ~foo~ ocorre fora do ~letfn~, ~foo~ é incapaz
de encontrar uma referência a si mesmo[fn:9].

Para tanto, podemos usar a  forma especial ~letrec~. Esta forma especial
funciona  de forma  idêntica a  ~letfn~, porém  garante que  cada função
local  definida tenha  acesso permanente  ao  escopo em  que todas  as
funções de ~letrec~ foram definidas.

~letrec~ pode, então, ser utilizado não apenas em contextos de definição
local de  funções recursivas  que sairão  daquele escopo,  como também
pode  ser  utilizado  para  definir funções  locais  que  se  utilizam
mutuamente, onde uma ou mais delas também sairá do escopo de ~letrec~.

#+begin_src majestic
(def bar
  (letrec ((foo (n)
             (when (< n 3)
               (print "foo #{}" (1+ n))
               (foo (1+ n)))))
    foo))
#+end_src

#+RESULTS[40a5ba4fbbd2bf52f5f97ce0c462dd21540f7b73]:
: bar

A definição de  ~bar~, dessa vez, carrega uma função  que, antes, estava
associada ao  símbolo ~foo~; essa  função, porém, captura o  contexto de
~letrec~, onde o símbolo ~foo~ está bem-definido como sendo uma referência
a ela mesma.

#+begin_src majestic
(bar 0)
#+end_src

#+RESULTS[864f55666bfe2165e434fb52ccc4cb5bae0186f2]:
: foo #1
: foo #2
: foo #3
: nil

