doc/html/02-03-escrevendo-programas.html

<div id="outline-container-org76c07ac" class="outline-4">
<h4 id="org76c07ac">Funções locais recursivas.</h4>
<div class="outline-text-4" id="text-org76c07ac">
<p>
O uso de <code>letfn</code> é suficiente  para a maioria das situações onde funções
locais  são necessárias,  porém, este  exemplo falha  quando a  função
local precisa  ser recursiva <b>e</b>  precisa ser executada em  outro escopo
que não seja o local.
</p>

<p>
Considere o  exemplo a seguir.  Temos um uso  de <code>letfn</code> que  define uma
função local <code>foo</code>, igualmente recursiva  como no exemplo de recursão em
funções globais. Todavia, o escopo de  <code>letfn</code> retorna a função ligada a
<code>foo</code> localmente, que é então atribuída ao símbolo <code>bar</code> globalmente.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> bar
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">letfn</span> <span style="color: #87cefa;">(</span><span style="color: #ffd700;">(</span>foo <span style="color: #da70d6;">(</span>n<span style="color: #da70d6;">)</span>
            <span style="color: #da70d6;">(</span><span style="color: #569cd6;">when</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">&lt;</span> n 3<span style="color: #87cefa;">)</span>
              <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">print</span> <span style="color: #ce9178;">"foo #{}"</span> <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> n<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
              <span style="color: #87cefa;">(</span>foo <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> n<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
    foo<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
bar
</pre>


<p>
Quando <code>bar</code>  for executada,  note que,  mesmo que  a função  tenha sido
originalmente atribuída como  <code>foo</code>, como este símbolo já  não existe no
contexto local (e nem em um contexto global), <code>bar</code> executará apenas uma
vez, mostrando um erro assim que <code>foo</code> for invocada.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>bar 0<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
foo #1
Error: foo is unbound
</pre>


<p>
Isso ocorre  porque, quando definimos  uma função recursiva  local via
<code>letfn</code>, essa função não captura o  escopo na qual foi criada; em outras
palavras, quando a execução de <code>foo</code> ocorre fora do <code>letfn</code>, <code>foo</code> é incapaz
de encontrar uma referência a si mesmo<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>

<p>
Para tanto, podemos usar a  forma especial <code>letrec</code>. Esta forma especial
funciona  de forma  idêntica a  <code>letfn</code>, porém  garante que  cada função
local  definida tenha  acesso permanente  ao  escopo em  que todas  as
funções de <code>letrec</code> foram definidas.
</p>

<p>
<code>letrec</code> pode, então, ser utilizado não apenas em contextos de definição
local de  funções recursivas  que sairão  daquele escopo,  como também
pode  ser  utilizado  para  definir funções  locais  que  se  utilizam
mutuamente, onde uma ou mais delas também sairá do escopo de <code>letrec</code>.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> bar
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">letrec</span> <span style="color: #87cefa;">(</span><span style="color: #ffd700;">(</span>foo <span style="color: #da70d6;">(</span>n<span style="color: #da70d6;">)</span>
             <span style="color: #da70d6;">(</span><span style="color: #569cd6;">when</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">&lt;</span> n 3<span style="color: #87cefa;">)</span>
               <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">print</span> <span style="color: #ce9178;">"foo #{}"</span> <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> n<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
               <span style="color: #87cefa;">(</span>foo <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">1+</span> n<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
    foo<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
bar
</pre>


<p>
A definição de  <code>bar</code>, dessa vez, carrega uma função  que, antes, estava
associada ao  símbolo <code>foo</code>; essa  função, porém, captura o  contexto de
<code>letrec</code>, onde o símbolo <code>foo</code> está bem-definido como sendo uma referência
a ela mesma.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>bar 0<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
foo #1
foo #2
foo #3
nil
</pre>
</div>
</div>
</div>
</div>
