02-03-escrevendo-programas.org
** Controle de fluxo

#+index: condicional
Majestic Lisp também  provê algumas estruturas capazes  de controlar o
fluxo  de execução  de programas.  A  linguagem segue  a estrutura  de
outros Lisps nesse sentido,  replicando com muita similaridade algumas
formas especiais canônicas.

O primeiro tipo de condicional envolve a forma especial ~if~. Essa forma
é escrita segundo a regra sintática:

#+begin_example
(if <condição> <consequência> <alternativa>)
#+end_example

Assim,  ~<condição>~, ~<consequência>~  e ~<alternativa>~  são expressões  a
serem interpretadas segundo certas regras especiais.

Primeiramente,   Majestic  Lisp   tentará   interpretar  a   expressão
~<condição>~.  Caso seu  valor seja  verdadeiro (ou  seja, diferente  de
~nil~), a expressão ~<consequência>~  será interpretada. Caso contrário, a
expressão ~<alternativa>~ será interpretada.

A função ~with-one~  a seguir verifica pela nulidade de  um objeto. Caso
esse  objeto seja  nulo, será  retornado  um /cons/  entre ~0~  e ~1~;  caso
contrário, será retornado um /cons/ entre o objeto em questão e ~1~.

#+begin_src majestic
(defn with-one (x)
  (if (nilp x)
      (cons 0 1)
      (cons x 1)))
#+end_src

#+RESULTS[5b9ea75d231f451be77388542aa98d5d1605cd00]:
: with-one

#+begin_src majestic
(with-one nil)
#+end_src

#+RESULTS[cbdfe847caf6c3445ab0b5de0270f1cb96b84c55]:
: (0 . 1)

#+begin_src majestic
(with-one 5)
#+end_src

#+RESULTS[1e5a58529f03f3559f170b835f45be644ae25909]:
: (5 . 1)

Outro tipo  de condicional é a  forma ~cond~. Essa forma  é extremamente
útil quando lidamos  com condicionais que envolvem mais  que apenas um
predicado.

Por exemplo, uma condicional como esta:

#+begin_src majestic :eval no
(if pred1
    conseq1
    (if pred2
        conseq2
        conseq3))
#+end_src

...pode ser reescrita, usando ~cond~, da seguinte forma:

#+begin_src majestic :eval no
(cond (pred1 conseq1)
      (pred2 conseq2)
      (t conseq3))
#+end_src

Assim, podemos  transformar o que  seria um encadeamento  sucessivo de
~if~'s em algo sintaticamente agradável.

A função ~abs~ retratada a seguir  é uma forma redundante de definir uma
função que calcula  o valor absoluto de um número.  Caso o número seja
igual a  ~0~, será  retornado ~0~; caso  o número seja  maior que  ~0~, este
mesmo número será  retornado; mas, se o número for  menor que ~0~, então
será retornado o valor aritmeticamente oposto a ele.

#+begin_src majestic
(defn abs (x)
  (cond ((zerop x) 0)
        ((> x 0) x)
        (t (- x))))
#+end_src

#+RESULTS[466d724c33dc51d5979fd7a43047e67b94aaddbb]:
: abs

#+begin_src majestic
(abs 0)
#+end_src

#+RESULTS[74e6a27662d513b983bd91a35caa7dedb3a885b3]:
: 0

#+begin_src majestic
(abs 5)
#+end_src

#+RESULTS[8cd2e64b7c3e104c73e2e15b11e5034f6af444c2]:
: 5

#+begin_src majestic
(abs -5)
#+end_src

#+RESULTS[f59a3b87dc94ce324115bfec970022311740834d]:
: 5

