doc/html/02-03-escrevendo-programas.html

<div id="outline-container-orgef46abb" class="outline-2">
<h2 id="orgef46abb"><span class="section-number-2">3.</span> Controle de fluxo</h2>
<div class="outline-text-2" id="text-3">
<p>
Majestic Lisp também  provê algumas estruturas capazes  de controlar o
fluxo  de execução  de programas.  A  linguagem segue  a estrutura  de
outros Lisps nesse sentido,  replicando com muita similaridade algumas
formas especiais canônicas.
</p>

<p>
O primeiro tipo de condicional envolve a forma especial <code>if</code>. Essa forma
é escrita segundo a regra sintática:
</p>

<pre class="example" id="org8ea8faf">
(if &lt;condição&gt; &lt;consequência&gt; &lt;alternativa&gt;)
</pre>

<p>
Assim,  <code>&lt;condição&gt;</code>, <code>&lt;consequência&gt;</code>  e <code>&lt;alternativa&gt;</code>  são expressões  a
serem interpretadas segundo certas regras especiais.
</p>

<p>
Primeiramente,   Majestic  Lisp   tentará   interpretar  a   expressão
<code>&lt;condição&gt;</code>.  Caso seu  valor seja  verdadeiro (ou  seja, diferente  de
<code>nil</code>), a expressão <code>&lt;consequência&gt;</code>  será interpretada. Caso contrário, a
expressão <code>&lt;alternativa&gt;</code> será interpretada.
</p>

<p>
A função <code>with-one</code>  a seguir verifica pela nulidade de  um objeto. Caso
esse  objeto seja  nulo, será  retornado  um <i>cons</i>  entre <code>0</code>  e <code>1</code>;  caso
contrário, será retornado um <i>cons</i> entre o objeto em questão e <code>1</code>.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> with-one <span style="color: #da70d6;">(</span>x<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">if</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">nilp</span> x<span style="color: #87cefa;">)</span>
      <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">cons</span> 0 1<span style="color: #87cefa;">)</span>
      <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">cons</span> x 1<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
with-one
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>with-one nil<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(0 . 1)
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>with-one 5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(5 . 1)
</pre>


<p>
Outro tipo  de condicional é a  forma <code>cond</code>. Essa forma  é extremamente
útil quando lidamos  com condicionais que envolvem mais  que apenas um
predicado.
</p>

<p>
Por exemplo, uma condicional como esta:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">if</span> pred1
    conseq1
    <span style="color: #da70d6;">(</span><span style="color: #569cd6;">if</span> pred2
        conseq2
        conseq3<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
&#x2026;pode ser reescrita, usando <code>cond</code>, da seguinte forma:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">cond</span> <span style="color: #da70d6;">(</span>pred1 conseq1<span style="color: #da70d6;">)</span>
      <span style="color: #da70d6;">(</span>pred2 conseq2<span style="color: #da70d6;">)</span>
      <span style="color: #da70d6;">(</span>t conseq3<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
Assim, podemos  transformar o que  seria um encadeamento  sucessivo de
<code>if</code>'s em algo sintaticamente agradável.
</p>

<p>
A função <code>abs</code> retratada a seguir  é uma forma redundante de definir uma
função que calcula  o valor absoluto de um número.  Caso o número seja
igual a  <code>0</code>, será  retornado <code>0</code>; caso  o número seja  maior que  <code>0</code>, este
mesmo número será  retornado; mas, se o número for  menor que <code>0</code>, então
será retornado o valor aritmeticamente oposto a ele.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> abs <span style="color: #da70d6;">(</span>x<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">cond</span> <span style="color: #87cefa;">(</span><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">zerop</span> x<span style="color: #ffd700;">)</span> 0<span style="color: #87cefa;">)</span>
        <span style="color: #87cefa;">(</span><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">&gt;</span> x 0<span style="color: #ffd700;">)</span> x<span style="color: #87cefa;">)</span>
        <span style="color: #87cefa;">(</span>t <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">-</span> x<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
abs
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>abs 0<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
0
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>abs 5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
5
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>abs -5<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
5
</pre>
</div>
</div>
