02-03-escrevendo-programas.org
** /Quasiquoting/

#+index: quasiquote
Um  dos elementos  cruciais da  metaprogramação em  Majestic Lisp  é a
ideia de /quasiquoting/. O conceito é  muito similar à ideia de /quoting/,
onde toda  uma lista  /quasiquotada/ é, por  padrão, tratada  como dados
pelo interpretador.

Todavia,  empregar  o recurso  do  /quasiquote/  permite ao  programador
estipular  alguns  dados  no  interior  de  uma  expressão  que  serão
efetivamente /interpretados/.   Em outras palavras, alguns  elementos da
lista serão dados  produzidos durante o processo de  retorno da mesma,
enquanto outros permanecerão intactos.

Uma lista quasiquotada é precedida pelo  acento grave (~`~), ao invés do
apóstrofo que simboliza o /quote/ (~'~). Algumas formas dentro dessa lista
poderão estar  precedidas pelos  símbolos especiais  de /unquote/  (~,~) e
/unquote-splice/ (~,@~).

#+begin_src majestic
(defn hello (name)
  `(good morning ,name and have a nice day))
#+end_src

#+RESULTS[f44685c20fd608cf4e8d4fd4f7c512f85cdbedd5]:
: hello

#+begin_src majestic
(hello 'fulano)
#+end_src

#+RESULTS[948ee65de8fda7c31bd11499557b372ac6b66827]:
: (good morning fulano and have a nice day)

A função de usuário ~hello~  apresentada acima recebe um único argumento
-- ~name~ --  que será inserido diretamente numa  lista, precedido pelos
respectivos símbolos  ~good~ e  ~morning~. Veja que,  com o  /quasiquote/, é
possível deixar  claro o  local exato  onde o  valor associado  a ~name~
ficará, e  este valor é marcado  através do /unquote/ da  expressão ~name~
nesta lista.

Todavia,  o processo  de  /unquote/  não realiza  distinção  se o  valor
associado a ~name~ é uma lista ou não:

#+begin_src majestic
(hello '(fulano da silva))
#+end_src

#+RESULTS[47a10037b261147fddb5a68491e1d57f7fa42cc5]:
: (good morning (fulano da silva) and have a nice day)

Em uma situação ideal, podemos  realizar essa distinção reescrevendo a
função  ~hello~ de  forma que,  quando o  valor recebido  na chamada  da
função  for  uma  /lista/,  *apenas   seu  conteúdo  seja  adicionado  ao
resultado*. A este processo, damos o nome de /unquote-splice/.

#+begin_src majestic
(defn hello (name)
  (if (consp name)
      `(good morning ,@name and have a nice day)
      `(good morning ,name and have a nice day)))
#+end_src

#+RESULTS[39148ae4c1e524604201938ff7ef941b92904a65]:
: hello

#+begin_src majestic
(hello '(fulano da silva))
#+end_src

#+RESULTS[47a10037b261147fddb5a68491e1d57f7fa42cc5]:
: (good morning fulano da silva and have a nice day)

#+begin_src majestic
(hello 'fulano)
#+end_src

#+RESULTS[948ee65de8fda7c31bd11499557b372ac6b66827]:
: (good morning fulano and have a nice day)

Veja que, como previsto, apenas o conteúdo da lista /quotada/ ~(fulano da
silva)~  foi adicionado  diretamente à  lista, como  se seus  elementos
tivessem sido "desempacotados" na lista de nível superior.

* Footnotes

[fn:9] Isso ocorre  por intermédio de escopo dinâmico em  ~letfn~, o que
pode inclusive não ser desejável.

[fn:8] É interessante  notar que, em Majestic Lisp, a  função ~+~ também
pode operar  sobre um  único número, calculando  seu /conjugado/  -- uma
operação que funciona com números  complexos. Caso o número não possua
esse subtipo, ~+~ apenas retorna o número sem modificações.

[fn:6] Macros  auxiliam o  programador, possibilitando a  definição de
nova sintaxe que, em tempo de execução, se transforma em sintaxe menos
intuitiva. Veremos como isso funciona posteriormente.
