doc/html/02-03-escrevendo-programas.html

<div id="outline-container-orgd7e911c" class="outline-2">
<h2 id="orgd7e911c"><span class="section-number-2">4.</span> <i>Quasiquoting</i></h2>
<div class="outline-text-2" id="text-4">
<p>
Um  dos elementos  cruciais da  metaprogramação em  Majestic Lisp  é a
ideia de <i>quasiquoting</i>. O conceito é  muito similar à ideia de <i>quoting</i>,
onde toda  uma lista  <i>quasiquotada</i> é, por  padrão, tratada  como dados
pelo interpretador.
</p>

<p>
Todavia,  empregar  o recurso  do  <i>quasiquote</i>  permite ao  programador
estipular  alguns  dados  no  interior  de  uma  expressão  que  serão
efetivamente <i>interpretados</i>.   Em outras palavras, alguns  elementos da
lista serão dados  produzidos durante o processo de  retorno da mesma,
enquanto outros permanecerão intactos.
</p>

<p>
Uma lista quasiquotada é precedida pelo  acento grave (<code>`</code>), ao invés do
apóstrofo que simboliza o <i>quote</i> (<code>'</code>). Algumas formas dentro dessa lista
poderão estar  precedidas pelos  símbolos especiais  de <i>unquote</i>  (<code>,</code>) e
<i>unquote-splice</i> (<code>,@</code>).
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> hello <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">name</span><span style="color: #da70d6;">)</span>
  `<span style="color: #da70d6;">(</span>good morning ,<span style="color: #dcdcaa;">name</span> <span style="color: #569cd6;">and</span> have a nice day<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
hello
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>hello 'fulano<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(good morning fulano and have a nice day)
</pre>


<p>
A função de usuário <code>hello</code>  apresentada acima recebe um único argumento
&#x2013; <code>name</code> &#x2013;  que será inserido diretamente numa  lista, precedido pelos
respectivos símbolos  <code>good</code> e  <code>morning</code>. Veja que,  com o  <i>quasiquote</i>, é
possível deixar  claro o  local exato  onde o  valor associado  a <code>name</code>
ficará, e  este valor é marcado  através do <i>unquote</i> da  expressão <code>name</code>
nesta lista.
</p>

<p>
Todavia,  o processo  de  <i>unquote</i>  não realiza  distinção  se o  valor
associado a <code>name</code> é uma lista ou não:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>hello '<span style="color: #da70d6;">(</span>fulano da silva<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(good morning (fulano da silva) and have a nice day)
</pre>


<p>
Em uma situação ideal, podemos  realizar essa distinção reescrevendo a
função  <code>hello</code> de  forma que,  quando o  valor recebido  na chamada  da
função  for  uma  <i>lista</i>,  <b>apenas   seu  conteúdo  seja  adicionado  ao
resultado</b>. A este processo, damos o nome de <i>unquote-splice</i>.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> hello <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">name</span><span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">if</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">consp</span> <span style="color: #dcdcaa;">name</span><span style="color: #87cefa;">)</span>
      `<span style="color: #87cefa;">(</span>good morning ,@name <span style="color: #569cd6;">and</span> have a nice day<span style="color: #87cefa;">)</span>
      `<span style="color: #87cefa;">(</span>good morning ,<span style="color: #dcdcaa;">name</span> <span style="color: #569cd6;">and</span> have a nice day<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
hello
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>hello '<span style="color: #da70d6;">(</span>fulano da silva<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(good morning fulano da silva and have a nice day)
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>hello 'fulano<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(good morning fulano and have a nice day)
</pre>


<p>
Veja que, como previsto, apenas o conteúdo da lista <i>quotada</i> <code>(fulano da
silva)</code>  foi adicionado  diretamente à  lista, como  se seus  elementos
tivessem sido "desempacotados" na lista de nível superior.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Macros  auxiliam o  programador, possibilitando a  definição de
nova sintaxe que, em tempo de execução, se transforma em sintaxe menos
intuitiva. Veremos como isso funciona posteriormente.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
É interessante  notar que, em Majestic Lisp, a  função <code>+</code> também
pode operar  sobre um  único número, calculando  seu <i>conjugado</i>  &#x2013; uma
operação que funciona com números  complexos. Caso o número não possua
esse subtipo, <code>+</code> apenas retorna o número sem modificações.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Isso ocorre  por intermédio de escopo dinâmico em  <code>letfn</code>, o que
pode inclusive não ser desejável.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
